In [1]:
def pattern_2(number):
    count = 0
    for i in range(1, number+1):
        for j in range(1, i+1):
            count = count +1
            print (count, end=" ")
        print ("\n")
pattern_2(5)

1

2 3

4 5 6

7 8 9 10

11 12 13 14 15

In [3]:
from functools import reduce
def product_except_self(nums):
    total_product = reduce(lambda x,y : x*y,nums)
    return [total_product // num for num in nums]
nums = [1,2,3,4]
print (product_except_self(nums))

[24, 12, 8, 6]

In [6]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Mobile Number': ['123-456-7890', '234-567-8901', '345-678-9012', '456-789-0123']
}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

      Name  Age Mobile Number
0    Alice   25  123-456-7890
1      Bob   30  234-567-8901
2  Charlie   35  345-678-9012
3    David   40  456-789-0123

In [30]:
df[df.apply(lambda row: row['Age']> 20, axis =1 )]['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [32]:
df[df['Age'] > 30]

      Name  Age Mobile Number
2  Charlie   35  345-678-9012
3    David   40  456-789-0123

In [34]:
def fibo():
    a,b = 0,1
    while True:
        yield a
        a,b = b, a+b

ff = fibo()
for _ in range(1,10):
    print (next(ff))

0
1
1
2
3
5
8
13
21

In [35]:
def fibo_recursive(num):
    if num <=0:
        return 0
    elif num ==1:
        return 1
    else:
        return fibo_recursive(num - 1)+ fibo_recursive(num -2)

[ fibo_recursive (i) for i in range(10)]

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]